In [2]:
import sqlite3

In [3]:
con = sqlite3.connect("students2.sqlite3")

In [4]:
cur=con.cursor()

In [44]:
CREATE_TABLE_QUERY="""
CREATE TABLE student(
	id int primary key,
	name varchar not null,
	address varchar not null,
	college varchar not null,
	age int not null,
	gender varchar(1) not null,
	faculty varchar not null
);

"""
cur.execute(CREATE_TABLE_QUERY)

In [45]:
insert_records = """
INSERT INTO student 
(id, name, address, college, age, gender, faculty)
VALUES
(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT'),
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT'),
(3, 'gita', 'pokhara', 'ncit', 21, 'f', 'SE'),
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'CE');
"""

# Execute the insert records
cur.execute(insert_records)

# Commit the transaction

In [46]:
con.commit()

In [ ]:
cur.execute()

In [53]:
students = cur.execute("""SELECT * FROM student""")
for student in students:
    print(student)

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT')
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT')
(3, 'gita', 'pokhara', 'ncit', 21, 'f', 'SE')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'CE')

In [54]:
cur.execute("ALTER table student add university varchar not null default 'tu';")

In [72]:
address: input("enter a address:")
students=cur.execute(f"""SELECT * FROM student where address='{address}';""")
for student in students:
    print(student)

enter a address: lalitpur

(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'tu')

In [9]:
a: input("enter a address:")
students=cur.execute(f"""SELECT * FROM student where address='{a}';""")
for student in students:
    print(student)

#sql injection

enter a address: bhaktapur

NameError: name 'a' is not defined

In [6]:
address = input("Enter the address: ")
students = cur.execute("""SELECT * FROM student WHERE address = ?;""", (address,))

for student in students:
    print(student)

Enter the address:  kathmandu

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT', 'tu')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'CE', 'tu')

In [7]:
s

In [10]:
students=[
    (8,'hari bahadur', 'laltipur','ncit',23,'m','SE','PU'),
    (9,'madan bahadur', 'kathmandu','british college',24,'m','SIT','UK'),
    (10,'maya devi', 'laltipur','ncit',23,'f','SE','PU')
]

insert_records="""
    INSERT INTO student('id','name','address','college','age','gender','faculty','university') 
    VALUES(?,?,?,?,?,?,?,?);
"""
for student in students:
    cur.execute(insert_records,student)
    con.commit()